# Essential Basic Functionality

In [1]:
import pandas as pd
import numpy as np

In [2]:
index = pd.date_range('1/1/2000', periods=8, freq='D')

In [3]:
s = pd.Series(
    np.random.randn(5), 
    index=['a', 'b', 'c', 'd', 'e']
)

In [4]:
df = pd.DataFrame(
    np.random.randn(8, 3),
    index=index,
    columns=['A', 'B', 'C']
)

# Attributes

In [20]:
df2 = pd.DataFrame(
    {
        'one': pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
        'two': {'a': 1, 'b': None, 'c': 14},
        'three': {'a': 1, 'b': 18, 'c': None},
    }
)

In [21]:
df2

        one   two  three
a  0.626891   1.0    1.0
b -0.660046   NaN   18.0
c -0.386799  14.0    NaN

In [22]:
df2.index

Index(['a', 'b', 'c'], dtype='object')

In [23]:
df2.columns

Index(['one', 'two', 'three'], dtype='object')

In [24]:
df2.iloc[1] == df2.loc['b']

one       True
two      False
three     True
Name: b, dtype: bool

In [25]:
row = df2.iloc[2]

In [26]:
column = df2['two']

In [27]:
df2 - row

        one   two  three
a  1.013690 -13.0    NaN
b -0.273247   NaN    NaN
c  0.000000   0.0    NaN

In [28]:
df2.sub(row, axis=1)

        one   two  three
a  1.013690 -13.0    NaN
b -0.273247   NaN    NaN
c  0.000000   0.0    NaN

In [29]:
df3 = df2.copy()

In [30]:
df3.loc['b', 'two'] = 0

In [31]:
df3

        one   two  three
a  0.626891   1.0    1.0
b -0.660046   0.0   18.0
c -0.386799  14.0    NaN

In [32]:
df2.add(df3, fill_value=10)

        one   two  three
a  1.253783   2.0    2.0
b -1.320091  10.0   36.0
c -0.773598  28.0    NaN

In [33]:
df2.add(df3, fill_value=10).fillna(11)

        one   two  three
a  1.253783   2.0    2.0
b -1.320091  10.0   36.0
c -0.773598  28.0   11.0